app/controllers/articles_controller.rb

  def index
    @articles = Article.order(created_at: :desc).paginate(page: params[:page], per_page: 3)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]